cc-env/DebianTeX.html
---
title: TeX 環境の構築
date: 2017-03-16 14:25:13
layout: cc-env
lang: ja
ref: cc-env/DebianTeX
permalink: /cc-env/DebianTeX.html
---
<div id="toc-wrapper">
<nav id="table-of-contents">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8ce64ef">Debian でのTeX 環境の構築</a></li>
<li><a href="#orgca973e2">インストール</a>
<ul>
<li><a href="#org4f22ef8">とりあえず <code>pTeX,upTeX</code> を使えるようにする:</a></li>
<li><a href="#orgf4ae074"><code>XeTeX, LuaTeX</code> も使えるようにする:</a></li>
<li><a href="#orga89c468">DVI と PDF の Viewer</a></li>
</ul>
</li>
<li><a href="#org5a10dfd">フォントの埋め込みと表示設定</a></li>
<li><a href="#org757e25e">XeLaTeX, pdfLaTeX, LuaLaTeX での日本語処理.</a>
<ul>
<li><a href="#orgaba5454">XeTeX</a></li>
<li><a href="#orgd93c967">LuaTeX</a></li>
<li><a href="#orgdf3c0c4">pdfLaTeX で日本語組版</a></li>
</ul>
</li>
<li><a href="#org45e72c1">足りないスタイルとかあれこれ</a></li>
<li><a href="#org59bc23e">参考文献</a></li>
</ul>
</div>
</nav>
</div>
<a href="#toc-toggle" class="btn toc-btn" id="toc-toggle">&#30446;&#27425;</a>
<p>
Related <a href='index.html'>Index</a> <a href='Emacs.html'>Emacs</a> <a href="index.html#ID-591f6b0d-55ff-48eb-b095-401cdfa0d536">Debian</a>
</p>

<div id="outline-container-org8ce64ef" class="outline-2">
<h2 id="org8ce64ef">Debian でのTeX 環境の構築</h2>
<div class="outline-text-2" id="text-org8ce64ef">
<p>
個人的には，
</p>
<ul class="org-ul">
<li>pLaTeX: (計算機にそれほど詳しくない)他人とデータのやりとりをする時(共著なんか)</li>
<li>XeLaTeX or LuaTeX: 個人で作業する時，もしくは複数人でも説明が楽な相手の場合</li>
</ul>
<p>
と使い分けています．
多分，多くの人々が現状では p(La)TeX をお使いかと思います．
共著作業の際に(年上の方々に)説明するのが楽ですし，
学会のTeXフォーマットが p(La)TeX 前提だったりするので，
わりと離れられませんよね.
</p>

<p>
Jessie の頃のお話ですが，
TeXLive リリースマネージャであり，
Debian の TeXLive のパッケージメンテナでもある Norbert Perining さんによる
<a href="http://www.preining.info/blog/2014/12/writing-japanese-in-latex-part-1-introduction/">Writing Japanese in LaTeX : Part 1 – Introduction | There and back again"</a>
もご覧下さい.
英語の記事ですが，
現在使える TeX Engine での日本語組版についてのサマリがあります.
</p>
</div>
</div>
<div id="outline-container-orgca973e2" class="outline-2">
<h2 id="orgca973e2">インストール</h2>
<div class="outline-text-2" id="text-orgca973e2">
<p>
何も考えずに
</p>
<pre class="example">
% sudo apt-get install texlive-full
</pre>
<p>
でも良いですが，結構なサイズになります
(とはいえ，今時数GB程度だと気にならないかと思いますけれど)．
</p>

<p>
個別にインストールする場合は以下の通り．
</p>
</div>
<div id="outline-container-org4f22ef8" class="outline-3">
<h3 id="org4f22ef8">とりあえず <code>pTeX,upTeX</code> を使えるようにする:</h3>
<div class="outline-text-3" id="text-org4f22ef8">
<p>
多分, 以下で OK
</p>
<pre class="example">
% sudo apt-get install texlive-lang-japanese
</pre>
<p>
上記パッケージを install することで <code>ptex2pdf</code> も使えるようになります．
</p>
</div>
</div>
<div id="outline-container-orgf4ae074" class="outline-3">
<h3 id="orgf4ae074"><code>XeTeX, LuaTeX</code> も使えるようにする:</h3>
<div class="outline-text-3" id="text-orgf4ae074">
<p>
多分, 以下で OK
</p>
<pre class="example">
% sudo apt-get install texlive-xetex
% sudo apt-get install texlive-luatex
</pre>
</div>
</div>
<div id="outline-container-orga89c468" class="outline-3">
<h3 id="orga89c468">DVI と PDF の Viewer</h3>
<div class="outline-text-3" id="text-orga89c468">
<pre class="example">
% sudo apt-get install evince xdvik-ja
</pre>
<p>
Debian のデフォルトデスクトップ環境はGNOMEなので，
PDF の閲覧には Evince を使うのかな?
日本語の表示が可能な xdvi, いわゆる pxdvi は
<a href="https://packages.qa.debian.org/x/xdvik-ja.html">xdvik-ja</a> としてパッケージを提供しています
(とはいえ，今なら直接 PDF を閲覧するのが良いと思いますが&#x2026;)．
</p>
</div>
</div>
</div>
<div id="outline-container-org5a10dfd" class="outline-2">
<h2 id="org5a10dfd">フォントの埋め込みと表示設定</h2>
<div class="outline-text-2" id="text-org5a10dfd">
<p>
まず, <code>cjk-gs-integrate</code> を使って,
Ghostscript に現在システムに導入されているフォントを教えてあげましょう.
</p>
<pre class="example">
% sudo cjk-gs-integrate --link-texmf --force
</pre>
<p>
この後, 実際に埋め込むフォントを設定しておきます.
</p>
<pre class="example">
% sudo apt-get install fonts-ipaexfonts     # &lt;-- install されていなかったら.
% sudo kanji-config-updmap-sys ipaex
</pre>
</div>
</div>
<div id="outline-container-org757e25e" class="outline-2">
<h2 id="org757e25e">XeLaTeX, pdfLaTeX, LuaLaTeX での日本語処理.</h2>
<div class="outline-text-2" id="text-org757e25e">
</div><div id="outline-container-orgaba5454" class="outline-3">
<h3 id="orgaba5454">XeTeX</h3>
<div class="outline-text-3" id="text-orgaba5454">
<p>
とりあえず日本語での組版に困る事はないでしょう.
例えば以下のソースを <code>xelatex</code> で typeset することで，
IPA{明朝,ゴシック}が埋め込まれた PDF が生成されます．
</p>
<div class="org-src-container">
<pre class="src src-japanese-latex"><span style="color: #FF7F7F;">\documentclass</span>[<span style="color: #7F7FFF;">a4paper</span>]{<span style="color: #BF7FFF;">bxjsarticle</span>}
<span style="color: #FF7F7F;">\usepackage</span>{<span style="color: #BF7FFF;">zxjatype</span>}
<span style="color: #FF7F7F;">\usepackage</span>[<span style="color: #7F7FFF;">ipa</span>]{<span style="color: #BF7FFF;">zxjafont</span>}
<span style="color: #FF7F7F;">\usepackage</span>{<span style="color: #BF7FFF;">xltxtra</span>}

<span style="color: #FF7F7F;">\begin</span>{<span style="color: #BF7FFF;">document</span>}

<span style="color: #FF7F7F;">\section</span>{<span style="color: #ffff00; font-size: 133%; font-weight: bold;">&#24184;&#30000;&#38706;&#20276;&#12300;&#38642;&#12398;&#12356;&#12429;&#12339;&#12341;&#8213;&#8213;&#21375;&#38642;&#12301;</span>}
&#26223;&#38642;&#12392;&#12356;&#12402;&#12289;&#21375;&#38642;&#12392;&#12356;&#12402;&#12289;&#24950;&#38642;&#12392;&#12356;&#12408;&#12427;&#12289;&#12375;&#12363;&#12392;&#25351;&#12375;&#23450;&#12417;&#12425;&#12428;&#12383;&#12427;&#38642;&#12395;&#12399;&#12354;&#12425;&#12374;&#12427;&#12409;&#12375;&#12290;
&#21375;&#38642;&#29211;&#12383;&#12426;&#31994;&#32309;&#12347;&#12383;&#12426;&#12289;&#12392;&#12356;&#12408;&#12427;&#12289;&#29017;&#12395;&#12354;&#12425;&#12378;&#38642;&#12395;&#12354;&#12425;&#12378;&#32043;&#12434;&#26355;&#12365;&#20809;&#12434;&#27969;&#12377;&#12289;&#12392;&#12356;&#12408;&#12427;&#12289;
&#22823;&#20154;&#20316;&#30691;&#12289;&#20116;&#33394;&#27684;&#27699;&#12289;&#12392;&#12356;&#12408;&#12427;&#12289;&#37329;&#26607;&#21021;&#12417;&#12390;&#32350;&#32346;&#12289;&#29577;&#33865;&#28472;&#12367;&#27684;&#27699;&#12289;&#12392;&#12356;&#12408;&#12427;&#12289;
&#36996;&#12388;&#12390;&#20061;&#38660;&#12395;&#20837;&#12426;&#12390;&#27782;&#28707;&#12434;&#25104;&#12375;&#12289;&#22805;&#23888;&#29983;&#12378;&#12427;&#34389;&#40372;&#26494;&#12395;&#27512;&#12427;&#12289;
&#12392;&#12356;&#12408;&#12427;&#35433;&#12398;&#21477;&#12394;&#12393;&#12395;&#12424;&#12426;&#12390;&#35211;&#12428;&#12400;&#12289;&#27512;&#12377;&#12427;&#12392;&#12371;&#12429;&#12399;&#32654;&#12375;&#12365;&#38642;&#12392;&#12356;&#12405;&#12414;&#12391;&#12394;&#12426;&#12290;
<span style="color: #FF7F7F;">\end</span>{<span style="color: #BF7FFF;">document</span>}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd93c967" class="outline-3">
<h3 id="orgd93c967">LuaTeX</h3>
<div class="outline-text-3" id="text-orgd93c967">
<p>
例えば以下のソースを <code>lualatex</code>
で typeset することで，IPAex{明朝,ゴシック}が埋め込まれた PDF が生成されます．
</p>
<div class="org-src-container">
<pre class="src src-japanese-latex"><span style="color: #FF7F7F;">\documentclass</span>{<span style="color: #BF7FFF;">ltjsarticle</span>}
<span style="color: #FF7F7F;">\usepackage</span>[<span style="color: #7F7FFF;">ipaex</span>]{<span style="color: #BF7FFF;">luatexja-preset</span>}
<span style="color: #FF7F7F;">\begin</span>{<span style="color: #BF7FFF;">document</span>}

<span style="color: #FF7F7F;">\section</span>{<span style="color: #ffff00; font-size: 133%; font-weight: bold;">&#24184;&#30000;&#38706;&#20276;&#12300;&#38642;&#12398;&#12356;&#12429;&#12339;&#12341;&#8213;&#8213;&#21375;&#38642;&#12301;</span>}
&#26223;&#38642;&#12392;&#12356;&#12402;&#12289;&#21375;&#38642;&#12392;&#12356;&#12402;&#12289;&#24950;&#38642;&#12392;&#12356;&#12408;&#12427;&#12289;&#12375;&#12363;&#12392;&#25351;&#12375;&#23450;&#12417;&#12425;&#12428;&#12383;&#12427;&#38642;&#12395;&#12399;&#12354;&#12425;&#12374;&#12427;&#12409;&#12375;&#12290;
&#21375;&#38642;&#29211;&#12383;&#12426;&#31994;&#32309;&#12347;&#12383;&#12426;&#12289;&#12392;&#12356;&#12408;&#12427;&#12289;&#29017;&#12395;&#12354;&#12425;&#12378;&#38642;&#12395;&#12354;&#12425;&#12378;&#32043;&#12434;&#26355;&#12365;&#20809;&#12434;&#27969;&#12377;&#12289;&#12392;&#12356;&#12408;&#12427;&#12289;
&#22823;&#20154;&#20316;&#30691;&#12289;&#20116;&#33394;&#27684;&#27699;&#12289;&#12392;&#12356;&#12408;&#12427;&#12289;&#37329;&#26607;&#21021;&#12417;&#12390;&#32350;&#32346;&#12289;&#29577;&#33865;&#28472;&#12367;&#27684;&#27699;&#12289;&#12392;&#12356;&#12408;&#12427;&#12289;
&#36996;&#12388;&#12390;&#20061;&#38660;&#12395;&#20837;&#12426;&#12390;&#27782;&#28707;&#12434;&#25104;&#12375;&#12289;&#22805;&#23888;&#29983;&#12378;&#12427;&#34389;&#40372;&#26494;&#12395;&#27512;&#12427;&#12289;
&#12392;&#12356;&#12408;&#12427;&#35433;&#12398;&#21477;&#12394;&#12393;&#12395;&#12424;&#12426;&#12390;&#35211;&#12428;&#12400;&#12289;&#27512;&#12377;&#12427;&#12392;&#12371;&#12429;&#12399;&#32654;&#12375;&#12365;&#38642;&#12392;&#12356;&#12405;&#12414;&#12391;&#12394;&#12426;&#12290;

<span style="color: #FF7F7F;">\end</span>{<span style="color: #BF7FFF;">document</span>}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdf3c0c4" class="outline-3">
<h3 id="orgdf3c0c4">pdfLaTeX で日本語組版</h3>
<div class="outline-text-3" id="text-orgdf3c0c4">
<p>
例えば以下を <code>pdflatex</code> で typeset することで，PDF が生成されます．
</p>
<div class="org-src-container">
<pre class="src src-japanese-latex"><span style="color: #FF7F7F;">\documentclass</span>[<span style="color: #7F7FFF;">pdflatex,jadriver=standard</span>]{<span style="color: #BF7FFF;">bxjsarticle</span>}
<span style="color: #FF7F7F;">\begin</span>{<span style="color: #BF7FFF;">document</span>}

<span style="color: #FF7F7F;">\section</span>{<span style="color: #ffff00; font-size: 133%; font-weight: bold;">&#24184;&#30000;&#38706;&#20276;&#12300;&#38642;&#12398;&#12356;&#12429;&#12339;&#12341;&#8213;&#8213;&#21375;&#38642;&#12301;</span>}
&#26223;&#38642;&#12392;&#12356;&#12402;&#12289;&#21375;&#38642;&#12392;&#12356;&#12402;&#12289;&#24950;&#38642;&#12392;&#12356;&#12408;&#12427;&#12289;&#12375;&#12363;&#12392;&#25351;&#12375;&#23450;&#12417;&#12425;&#12428;&#12383;&#12427;&#38642;&#12395;&#12399;&#12354;&#12425;&#12374;&#12427;&#12409;&#12375;&#12290;
&#21375;&#38642;&#29211;&#12383;&#12426;&#31994;&#32309;&#12347;&#12383;&#12426;&#12289;&#12392;&#12356;&#12408;&#12427;&#12289;&#29017;&#12395;&#12354;&#12425;&#12378;&#38642;&#12395;&#12354;&#12425;&#12378;&#32043;&#12434;&#26355;&#12365;&#20809;&#12434;&#27969;&#12377;&#12289;&#12392;&#12356;&#12408;&#12427;&#12289;
&#22823;&#20154;&#20316;&#30691;&#12289;&#20116;&#33394;&#27684;&#27699;&#12289;&#12392;&#12356;&#12408;&#12427;&#12289;&#37329;&#26607;&#21021;&#12417;&#12390;&#32350;&#32346;&#12289;&#29577;&#33865;&#28472;&#12367;&#27684;&#27699;&#12289;&#12392;&#12356;&#12408;&#12427;&#12289;
&#36996;&#12388;&#12390;&#20061;&#38660;&#12395;&#20837;&#12426;&#12390;&#27782;&#28707;&#12434;&#25104;&#12375;&#12289;&#22805;&#23888;&#29983;&#12378;&#12427;&#34389;&#40372;&#26494;&#12395;&#27512;&#12427;&#12289;
&#12392;&#12356;&#12408;&#12427;&#35433;&#12398;&#21477;&#12394;&#12393;&#12395;&#12424;&#12426;&#12390;&#35211;&#12428;&#12400;&#12289;&#27512;&#12377;&#12427;&#12392;&#12371;&#12429;&#12399;&#32654;&#12375;&#12365;&#38642;&#12392;&#12356;&#12405;&#12414;&#12391;&#12394;&#12426;&#12290;

<span style="color: #FF7F7F;">\end</span>{<span style="color: #BF7FFF;">document</span>}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org45e72c1" class="outline-2">
<h2 id="org45e72c1">足りないスタイルとかあれこれ</h2>
<div class="outline-text-2" id="text-org45e72c1">
<p>
<code>texlive-full</code> を入れておくと全部使えるようになる, で良いんだっけ?
最近は割と何も考えずに全部入れていたりする.
</p>

<p>
Emacs で上手く処理したい場合には, <code>auctex</code> とか入れておくと良いかと.
(最近 <code>YaTeX</code> 使ってないんだけれど, これ, LuaTeX なんかに対応してるんだっけ?)
</p>
</div>
</div>
<div id="outline-container-org59bc23e" class="outline-2">
<h2 id="org59bc23e">参考文献</h2>
<div class="outline-text-2" id="text-org59bc23e">
<ul class="org-ul">
<li><a href="http://uwabami.junkhub.org/log/20121202.html#p01">次期安定版 Debian 7.0 'Wheezy' での TeX 環境(特に pTeX 環境)について</a></li>
<li><a href="http://uwabami.junkhub.org/log/20121208.html#p01">Ubuntu 12.04/Debian Squeeze での TeXLive (&gt;=2012) 環境</a></li>
<li><a href="http://www.preining.info/blog/2014/12/writing-japanese-in-latex-part-1-introduction/">Writing Japanese in LaTeX : Part 1 – Introduction | There and back again</a></li>
<li><a href="https://packages.debian.org/jessie/texlive-full">Debian &#x2013; Details of package texlive-full in jessie</a></li>
<li><a href="http://qiita.com/_yyu_/items/6404656f822ce14db935">LaTeX - TeX処理系御伽話</a></li>
<li><a href="http://www.tug.org/texlive/debian.html">Debian support - TeX Live - TeX Users Group</a></li>
<li>TeX Wiki
<ul class="org-ul">
<li><a href="http://oku.edu.mie-u.ac.jp/~okumura/texwiki/?upTeX%2CupLaTeX"><a href="http://oku.edu.mie-u.ac.jp/~okumura/texwiki/?upTeX,upLaTeX">http://oku.edu.mie-u.ac.jp/~okumura/texwiki/?upTeX,upLaTeX</a></a></li>
<li><a href="http://oku.edu.mie-u.ac.jp/~okumura/texwiki/?Ghostscript"><a href="http://oku.edu.mie-u.ac.jp/~okumura/texwiki/?Ghostscript">http://oku.edu.mie-u.ac.jp/~okumura/texwiki/?Ghostscript</a></a></li>
<li><a href="http://oku.edu.mie-u.ac.jp/~okumura/texwiki/?XeTeX"><a href="http://oku.edu.mie-u.ac.jp/~okumura/texwiki/?XeTeX">http://oku.edu.mie-u.ac.jp/~okumura/texwiki/?XeTeX</a></a></li>
<li><a href="http://oku.edu.mie-u.ac.jp/~okumura/texwiki/?BXjscls"><a href="http://oku.edu.mie-u.ac.jp/~okumura/texwiki/?BXjscls">http://oku.edu.mie-u.ac.jp/~okumura/texwiki/?BXjscls</a></a></li>
<li><a href="http://oku.edu.mie-u.ac.jp/~okumura/texwiki/?LuaTeX-ja"><a href="http://oku.edu.mie-u.ac.jp/~okumura/texwiki/?LuaTeX-ja">http://oku.edu.mie-u.ac.jp/~okumura/texwiki/?LuaTeX-ja</a></a></li>
</ul></li>
</ul>
</div>
</div>
